CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F30x/GD32F30x_Firmware_Library_V2.1.4/Examples/USBFS/USB_Device/dev_firmware_update/src/exmc_nandflash.c
    nand_init_struct.nand_bank = EXMC_BANK1_NAND;
    nand_init_struct.ecc_size = EXMC_ECC_SIZE_2048BYTES;
    nand_init_struct.atr_latency = EXMC_ALE_RE_DELAY_1_HCLK;
    nand_init_struct.ctr_latency = EXMC_CLE_RE_DELAY_1_HCLK;
    nand_init_struct.ecc_logic = ENABLE;
    nand_init_struct.databus_width = EXMC_NAND_DATABUS_WIDTH_8B;
    nand_init_struct.wait_feature = ENABLE;
    nand_init_struct.common_space_timing = &nand_timing_init_struct;
    nand_init_struct.attribute_space_timing = &nand_timing_init_struct;

    exmc_nand_init(&nand_init_struct);

    /* enable EXMC NAND bank1 */
    exmc_nand_enable(EXMC_BANK1_NAND);

    /* build LUT(Look up table) */
    return nand_build_LUT(0);
}


/*!
    \brief      read NAND flash ID
    \param[in]  nand_id: structure of nand flash ID
    \param[out] none
    \retval     none
*/
void nand_read_id(nand_id_struct* nand_id)
{
    uint32_t data = 0;

    /* send command to the command area */
    NAND_CMD_AREA = NAND_CMD_READID;

    /* send address to the address area */
    NAND_ADDR_AREA = 0x00;



    /* sequence to read ID from NAND flash */
    data = *(__IO uint32_t *)(BANK_NAND_ADDR | EXMC_DATA_AREA);

    nand_id->maker_id   = ADDR_1ST_CYCLE(data);
    nand_id->device_id  = ADDR_2ND_CYCLE(data);
    nand_id->third_id   = ADDR_3RD_CYCLE(data);
    nand_id->fourth_id  = ADDR_4TH_CYCLE(data);
}

/*!
    \brief      write data to nand flash
    \param[in]  mem_addr: logic page number to be written
    \param[in]  pwritebuf: pointer to write data buffer
    \param[in]  size: data count
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
uint8_t nand_write(uint32_t mem_addr, uint8_t *pwritebuf, uint16_t size)
{
    uint32_t temp;
    uint32_t block_remain_size;
    nand_address_struct logaddr;

    temp = mem_addr % (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);

    logaddr.zone = mem_addr / (NAND_BLOCK_SIZE * NAND_PAGE_SIZE * NAND_ZONE_SIZE);
    logaddr.block = mem_addr / (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);
    logaddr.page = temp / NAND_PAGE_SIZE;
    logaddr.page_in_offset = temp % NAND_PAGE_SIZE;

    block_remain_size = (NAND_BLOCK_SIZE * NAND_PAGE_SIZE) - \
                        (NAND_PAGE_SIZE * logaddr.page + logaddr.page_in_offset);

    while(size > block_remain_size) {
        if(NAND_FAIL == nand_write_block(logaddr, pwritebuf, block_remain_size)) {
            return NAND_FAIL;
        }

        logaddr.block++;
        pwritebuf += block_remain_size;
        size -= block_remain_size;
        logaddr.page = 0;
        logaddr.page_in_offset = 0;
        block_remain_size = (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);
    }

    if(size > 0) {
        if(NAND_FAIL == nand_write_block(logaddr, pwritebuf, size)) {
            return NAND_FAIL;
        }
    }

    return NAND_OK;
}

/*!
    \brief      read data from nand flash
    \param[in]  mem_addr: logic page number to be read
    \param[in]  preadbuf: pointer to the data buffer to be read
    \param[in]  size: data count
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
uint8_t nand_read(uint32_t mem_addr, uint8_t *preadbuf, uint16_t size)
{
    uint32_t temp;
    uint32_t block_remain_size;
    nand_address_struct  logaddr;

    temp = mem_addr % (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);

    logaddr.zone = mem_addr / (NAND_BLOCK_SIZE * NAND_PAGE_SIZE * NAND_ZONE_SIZE);
    logaddr.block = mem_addr / (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);
    logaddr.page = temp / NAND_PAGE_SIZE;
    logaddr.page_in_offset = temp % NAND_PAGE_SIZE;

    block_remain_size = (NAND_BLOCK_SIZE * NAND_PAGE_SIZE) - \
                        (NAND_PAGE_SIZE * logaddr.page + logaddr.page_in_offset);

    while(size > block_remain_size) {
        if(NAND_FAIL == nand_read_block(logaddr, preadbuf, block_remain_size)) {
            return NAND_FAIL;
        }

        logaddr.block++;
        preadbuf += block_remain_size;
        size -= block_remain_size;
        logaddr.page = 0;
        logaddr.page_in_offset = 0;
        block_remain_size = (NAND_BLOCK_SIZE * NAND_PAGE_SIZE);
    }

    if(size > 0) {
        if(NAND_FAIL == nand_read_block(logaddr, preadbuf, size)) {
            return NAND_FAIL;
        }
    }

    return NAND_OK;
}

/*!
    \brief      scan and test specific block
    \param[in]  blocknum: block number
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
uint8_t nand_scan_block(uint32_t blocknum)
{
    uint32_t i, k;
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE;

    memset(temp_buf, 0x00, NAND_PAGE_TOTAL_SIZE);

    for(i = 0; i < BAD_BALOK_TEST_CYCLE; i++) {
        if(NAND_READY != exmc_nand_erase_block(blocknum)) {
            nand_mark_bad_block(blocknum);
            return NAND_FAIL;
        }

        addr.page = 0;
        for(k = 0; k < NAND_BLOCK_SIZE; k++) {
            exmc_nand_read_page(temp_buf, addr, NAND_PAGE_TOTAL_SIZE);

            if(NAND_OK != nand_judge_buf_ok(temp_buf, NAND_PAGE_TOTAL_SIZE, 0xFF)) {
                nand_mark_bad_block(blocknum);
                return NAND_FAIL;
            }

            addr.page++;
        }

        addr.page = 0;

        for(k = 0; k < NAND_BLOCK_SIZE; k++) {
            memset(temp_buf, 0x00, NAND_PAGE_TOTAL_SIZE);

            if(NAND_OK != exmc_nand_write_page(temp_buf, addr, NAND_PAGE_TOTAL_SIZE)) {
                nand_mark_bad_block(blocknum);
                return NAND_FAIL;
            }

            exmc_nand_read_page(temp_buf, addr, NAND_PAGE_TOTAL_SIZE);

            if(NAND_OK != nand_judge_buf_ok(temp_buf, NAND_PAGE_TOTAL_SIZE, 0x00)) {
                nand_mark_bad_block(blocknum);
                return NAND_FAIL;
            }

            addr.page++;
        }
    }

    if(NAND_READY != exmc_nand_erase_block(blocknum)) {
        nand_mark_bad_block(blocknum);
        return NAND_FAIL;
    }

    addr.page = 0;

    for(k = 0; k < NAND_BLOCK_SIZE; k++) {
        exmc_nand_read_page(temp_buf, addr, NAND_PAGE_TOTAL_SIZE);

        if(NAND_OK != nand_judge_buf_ok(temp_buf, NAND_PAGE_TOTAL_SIZE, 0xFF)) {
            nand_mark_bad_block(blocknum);
            return NAND_FAIL;
        }

        addr.page++;
    }

    return NAND_OK;
}

/*!
    \brief      check block is free block
    \param[in]  blocknum: block number
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
 uint8_t nand_judge_free_block(uint32_t blocknum)
{
    uint8_t flag;
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE + USED_OFFSET;

