CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F30x/GD32F30x_Firmware_Library_V2.1.4/Examples/USBFS/USB_Device/dev_firmware_update/src/exmc_nandflash.c
    if(nand_isbad_block(blocknum)) {
        return 0;
    }

    exmc_nand_read_page(&flag, addr, 1);

    if(0xFF == flag) {
        return 1;
    }

    return 0;
}

/*!
    \brief      copy data from a page to another page
    \param[in]  src_pageno: source page number
    \param[in]  dest_pageno: destination page number
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_page_copyback(uint32_t src_pageno, uint32_t dest_pageno)
{
    NAND_CMD_AREA = NAND_CMD_COPYBACK_A;

    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = src_pageno;
    NAND_ADDR_AREA = (src_pageno & 0xFF00) >> 8;

    NAND_CMD_AREA = NAND_CMD_COPYBACK_B;

    /* must wait, or read data wrong */
    NWAIT_OPERA_FUNC();

    NAND_CMD_AREA = NAND_CMD_COPYBACK_C;

    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = dest_pageno;
    NAND_ADDR_AREA = (dest_pageno & 0xFF00) >> 8;

    NAND_CMD_AREA = NAND_CMD_COPYBACK_D;

    /* check operation status */
    if(NAND_READY == exmc_nand_get_status()) {
        return NAND_OK;
    }

    return NAND_FAIL;
}

/*!
    \brief      copy data from a page to another page and update some data in target page
    \param[in]  src_pageno: source page number
    \param[in]  dest_pageno: destination page number
    \param[in]  pbuf: data buffer
    \param[in]  offset: offset in the page, data buffer will write data from it
    \param[in]  size: data buffer size
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_page_copyback_ex(uint32_t src_pageno, uint32_t dest_pageno, uint8_t *pbuf, uint16_t offset, uint16_t size)
{
    uint16_t i;

    NAND_CMD_AREA = NAND_CMD_COPYBACK_A;

    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = src_pageno;
    NAND_ADDR_AREA = (src_pageno & 0xFF00U) >> 8U;

    NAND_CMD_AREA = NAND_CMD_COPYBACK_B;

    /* must wait, or read data wrong */
    NWAIT_OPERA_FUNC();

    NAND_CMD_AREA = NAND_CMD_COPYBACK_C;

    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = 0;
    NAND_ADDR_AREA = dest_pageno;
    NAND_ADDR_AREA = (dest_pageno & 0xFF00U) >> 8U;

    /* need no data, need no wait */
    NAND_CMD_AREA = NAND_CMD_COPYBACK_C;

    NAND_ADDR_AREA = offset;
    NAND_ADDR_AREA = offset >> 8U;

    /* send data */
    for(i = 0; i < size; i++) {
        NAND_DATA_AREA = pbuf[i];
    }

    NAND_CMD_AREA = NAND_CMD_COPYBACK_D;

    /* check operation status */
    if(NAND_READY == exmc_nand_get_status()) {
        return NAND_OK;
    }

    return NAND_FAIL;
}

/*!
    \brief      write data to page
    \param[in]  pbuf: pointer on the buffer containing data to be written
    \param[in]  addr: the address of the data to be written
    \param[in]  bytecnt: byte count to be written
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_write_page(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    uint16_t i;

    /* send write page command */
    NAND_CMD_AREA = NAND_CMD_WRITE_1ST;

    NAND_ADDR_AREA = addr.page_in_offset;
    NAND_ADDR_AREA = addr.page_in_offset >> 8U;
    NAND_ADDR_AREA = ADDR_1ST_CYCLE(ROW_ADDRESS);
    NAND_ADDR_AREA = ADDR_2ND_CYCLE(ROW_ADDRESS);

    /* write data */
    for(i = 0; i < bytecnt; i++) {
        NAND_DATA_AREA = pbuf[i];
    }

    /* send 2nd cycle page programming command to the command area */
    NAND_CMD_AREA = NAND_CMD_WRITE_2ND;

    /* check operation status */
    if(NAND_READY == exmc_nand_get_status()) {
        return NAND_OK;
    }
    return NAND_FAIL;
}

/*!
    \brief      read data from page
    \param[in]  pbuf: pointer on the buffer filling data to be read
    \param[in]  addr: the address of the data to be read
    \param[in]  bytecnt: byte count to be read
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_read_page(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    uint16_t i;

    /* send read page command */
    NAND_CMD_AREA = NAND_CMD_READ1_1ST;

    NAND_ADDR_AREA = addr.page_in_offset;
    NAND_ADDR_AREA = addr.page_in_offset >> 8;
    NAND_ADDR_AREA = ADDR_1ST_CYCLE(ROW_ADDRESS);
    NAND_ADDR_AREA = ADDR_2ND_CYCLE(ROW_ADDRESS);

    NAND_CMD_AREA = NAND_CMD_READ1_2ND;

    /* must wait, or read data wrong */
    NWAIT_OPERA_FUNC();

    /* read data to buffer */
    for(i = 0; i < bytecnt; i++) {
        pbuf[i] = NAND_DATA_AREA;
    }

    return NAND_OK;
}

/*!
    \brief      write the spare area of one page data
    \param[in]  pbuf: pointer on the buffer containing data to be written
    \param[in]  addr: the address of the data to be written
    \param[in]  bytecnt: byte count to be written
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_write_spare(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    if(addr.page_in_offset < NAND_PAGE_SIZE) {
        return NAND_FAIL;
    }

    if(bytecnt + addr.page_in_offset > NAND_PAGE_TOTAL_SIZE) {
        return NAND_FAIL;
    }

    return exmc_nand_write_page(pbuf, addr, bytecnt);
}

/*!
    \brief      read data from the spare area of 1 page
    \param[in]  pbuf: pointer on the buffer filling data to be read
    \param[in]  addr: the address of the data to be read
    \param[in]  bytecnt: count of spare area to be read
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_read_spare(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    if(addr.page_in_offset < NAND_PAGE_SIZE) {
        return NAND_FAIL;
    }

    if(bytecnt + addr.page_in_offset > NAND_PAGE_TOTAL_SIZE) {
        return NAND_FAIL;
    }

    return exmc_nand_read_page(pbuf, addr, bytecnt);
}

/*!
    \brief      write data to the page main data area
    \param[in]  pbuf: pointer on the buffer containing data to be written
    \param[in]  addr: physical address data to be written
    \param[in]  bytecnt: byte count to be written
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_write_data(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    uint8_t *temppbuf = pbuf;

    while(bytecnt + addr.page_in_offset > NAND_PAGE_SIZE) {
        if(NAND_OK != exmc_nand_write_page(temppbuf,
                                           addr,
                                           NAND_PAGE_SIZE - addr.page_in_offset)) {
            return NAND_FAIL;
        }

