CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F30x/GD32F30x_Firmware_Library_V2.1.4/Examples/USBFS/USB_Device/dev_firmware_update/src/exmc_nandflash.c
        bytecnt -= NAND_PAGE_SIZE - addr.page_in_offset;
        temppbuf += NAND_PAGE_SIZE - addr.page_in_offset;
        addr.page++;
        addr.page_in_offset = 0;
    }

    if(bytecnt > 0) {
        if(NAND_OK != exmc_nand_write_page(temppbuf, addr, bytecnt)) {
            return NAND_FAIL;
        }
    }

    return NAND_OK;
}

/*!
    \brief      read data from the page main data area
    \param[in]  pbuf: pointer on the buffer filling data to be read
    \param[in]  addr: the physical address of the data to be read
    \param[in]  bytecnt: byte count to be read
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t exmc_nand_read_data(uint8_t *pbuf, nand_address_struct addr, uint16_t bytecnt)
{
    uint8_t *temppbuf = pbuf;

    while(bytecnt + addr.page_in_offset > NAND_PAGE_SIZE) {
        if(NAND_OK != exmc_nand_read_page(temppbuf, addr, NAND_PAGE_SIZE - addr.page_in_offset)) {
            return NAND_FAIL;
        }

        addr.page++;
        temppbuf += NAND_PAGE_SIZE - addr.page_in_offset;
        bytecnt -= NAND_PAGE_SIZE - addr.page_in_offset;
        addr.page_in_offset = 0;
    }

    if(bytecnt > 0) {
        if(NAND_OK != exmc_nand_read_page(temppbuf, addr, bytecnt)) {
            return NAND_FAIL;
        }
    }

    return NAND_OK;
}

/*!
    \brief      erase data specified block
    \param[in]  blocknum: block number to be erased data
    \param[out] none
    \retval     NAND memory status
*/
static uint8_t exmc_nand_erase_block(uint32_t blocknum)
{
    /* send erase command */
    NAND_CMD_AREA = NAND_CMD_ERASE_1ST;

    blocknum <<= 6;
    NAND_ADDR_AREA = blocknum;
    NAND_ADDR_AREA = blocknum >> 8;

    /* send 2nd cycle erase command to command area */
    NAND_CMD_AREA = NAND_CMD_ERASE_2ND;

    return (exmc_nand_get_status());
}

/*!
    \brief      read the NAND flash status
    \param[in]  none
    \param[out] none
    \retval     NAND_BUSY, NAND_READY, NAND_ERROR
*/
static uint8_t exmc_nand_read_status(void)
{
    uint8_t data;
    uint8_t status = NAND_BUSY;

    /* read operation status */
    NAND_CMD_AREA = NAND_CMD_STATUS;
    data = *(__IO uint8_t *)(BANK_NAND_ADDR);

    if(NAND_ERROR == (data & NAND_ERROR)) {
        status = NAND_ERROR;
    } else if(NAND_READY == (data & NAND_READY)) {
        status = NAND_READY;
    } else {
        status = NAND_BUSY;
    }

    return (status);
}

/*!
    \brief      get the NAND operation status
    \param[in]  none
    \param[out] none
    \retval     new status of the NAND operation
*/
static uint8_t exmc_nand_get_status(void)
{
    uint32_t timeout = 0x10000;
    uint8_t status = NAND_READY;

    status = exmc_nand_read_status();

    /* wait for operation is over, exit when time out */
    while((NAND_READY != status) && (0x00U != timeout)) {
        status = exmc_nand_read_status();
        timeout--;
    }

    if(0x00 == timeout) {
        status =  NAND_TIMEOUT_ERROR;
    }

    return status;
}

/*!
    \brief      write the main area information for the specified logic addresses
    \param[in]  memaddr: the logic address of the data to be written
    \param[in]  pwritebuf: pointer on the buffer containing data to be written
    \param[in]  bytecount: byte count to be written
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_write_new_block(nand_address_struct addr, nand_address_struct logaddr, uint8_t *pwritebuf, uint16_t size)
{
    uint16_t n, i, offset;
    uint16_t newblock;

    for(n = 0; n < 5; n++) {
        if(addr.block & 0x0001) {
            newblock = nand_find_free_block(BLOCK_EVEN);
        } else {
            newblock = nand_find_free_block(BLOCK_ODD);
        }

        if(newblock >= NAND_BLOCK_COUNT) {
            return NAND_FAIL;
        }

        for(i = 0; i < NAND_BLOCK_SIZE; i++) {
            if(i == addr.page) {
                offset = addr.page_in_offset;
                while(offset + size > NAND_PAGE_SIZE) {
                    if(exmc_nand_page_copyback_ex(addr.block * NAND_BLOCK_SIZE + i,
                                                  newblock * NAND_BLOCK_SIZE + i,
                                                  pwritebuf, offset,
                                                  NAND_PAGE_SIZE - offset) == NAND_FAIL) {
                        nand_mark_bad_block(newblock);
                        nand_build_LUT(addr.zone);

                        break;
                    }

                    pwritebuf += NAND_PAGE_SIZE - offset;
                    size -= NAND_PAGE_SIZE - offset;
                    offset = 0;
                    i++;
                }

                if(size > 0) {
                    if(exmc_nand_page_copyback_ex(addr.block * NAND_BLOCK_SIZE + i,
                                                  newblock * NAND_BLOCK_SIZE + i,
                                                  pwritebuf, offset, size) == NAND_FAIL) {
                        nand_mark_bad_block(newblock);
                        nand_build_LUT(addr.zone);
                        break;
                    }
                }
            } else {
                if(exmc_nand_page_copyback(addr.block * NAND_BLOCK_SIZE + i,
                                           newblock * NAND_BLOCK_SIZE + i) == NAND_FAIL) {
                    nand_mark_bad_block(newblock);
                    nand_build_LUT(addr.zone);
                    break;
                }
            }
        }

        if(i == NAND_BLOCK_SIZE) {
            if(NAND_FAIL == nand_mark_used_block(newblock)) {
                nand_mark_bad_block(newblock);
                nand_build_LUT(addr.zone);
                continue;
            } else {
                nand_mark_logic_block(newblock, logaddr.block);
            }

            if(NAND_READY != exmc_nand_erase_block(addr.block)) {
                nand_mark_bad_block(addr.block);
                nand_build_LUT(addr.zone);
                continue;
            }

