CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F30x/GD32F30x_Firmware_Library_V2.1.4/Examples/USBFS/USB_Device/dev_firmware_update/src/exmc_nandflash.c
            nand_build_LUT(addr.zone);
            break;
        }
    }

    return NAND_OK;
}

/*!
    \brief      write data to block
    \param[in]  logaddr: logic address to be written
    \param[in]  pwritebuf: pointer to write data buffer
    \param[in]  size: data count
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_write_block(nand_address_struct logaddr, uint8_t *pwritebuf, uint16_t size)
{
    uint16_t PBN;
    nand_address_struct addr;

    if(cur_zone != logaddr.zone) {
        nand_build_LUT(logaddr.zone);
    }

    PBN = LUT_tab[logaddr.block];

    if(0xFFFFU == PBN) {
        return NAND_FAIL;
    }

    addr.zone = logaddr.zone;
    addr.block = PBN & 0x03FF;
    addr.page = logaddr.page;
    addr.page_in_offset = logaddr.page_in_offset;

    if(PBN & USED_BLOCK) {
        return nand_write_new_block(addr, logaddr, (uint8_t *)pwritebuf, size);
    } else {
        if(NAND_FAIL == exmc_nand_write_data((uint8_t *)pwritebuf, addr, size)) {
            return NAND_FAIL;
        }

        if(NAND_FAIL == nand_mark_used_block(addr.block)) {
            return NAND_FAIL;
        } else {
            if(NAND_FAIL == nand_mark_logic_block(addr.block, logaddr.block)) {
                return NAND_FAIL;
            }
        }

        return NAND_OK;
    }
}

/*!
    \brief      read the main area information for the specified logic addresses
    \param[in]  memaddr: the logic address of the data to be read
    \param[in]  preadbuf: pointer on the buffer containing data to be read
    \param[in]  bytecount: byte count to be reas
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_read_block(nand_address_struct logaddr, uint8_t *preadbuf, uint16_t size)
{
    uint16_t PBN;
    nand_address_struct addr;

    if(cur_zone != logaddr.zone) {
        nand_build_LUT(logaddr.zone);
    }

    PBN = LUT_tab[logaddr.block];
    addr.block = PBN & 0x03FF;

    if(addr.block >= NAND_BLOCK_COUNT) {
        return NAND_FAIL;
    }

    addr.zone = logaddr.zone;
    addr.page = logaddr.page;
    addr.page_in_offset = logaddr.page_in_offset;

    if(NAND_FAIL == exmc_nand_read_data((uint8_t *)preadbuf, addr, size)) {
        return NAND_FAIL;
    }

    return NAND_OK;
}

/*!
    \brief      build NAND flash look up table
    \param[in]  zone: bulid zone
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_build_LUT(uint16_t zone)
{
    uint16_t logic_blockID;
    uint16_t bad_block, cur_block, free_block;
    uint8_t spare_area[NAND_SPARE_AREA_SIZE];
    nand_address_struct addr;

    cur_zone = zone;
    addr.zone = cur_zone;
    addr.block = 0x00;
    addr.page = 0x00;
    addr.page_in_offset = NAND_PAGE_SIZE;

    /* 1st step : init */
    for(cur_block = 0; cur_block < NAND_ZONE_SIZE; cur_block++) {
        LUT_tab[cur_block] = FREE_BLOCK;
    }

    /* init Pointers */
    bad_block = NAND_ZONE_SIZE - 1;
    cur_block = 0;

    /* 2nd step : locate used and bad blocks */
    while(cur_block < NAND_ZONE_SIZE) {
        addr.block = cur_block;
        exmc_nand_read_spare(spare_area, addr, NAND_SPARE_AREA_SIZE);

        if(spare_area[BI_OFFSET] != 0xFF) {
            LUT_tab[bad_block--] |= cur_block | (uint16_t)BAD_BLOCK;
            LUT_tab[cur_block] &= (uint16_t)~FREE_BLOCK;

            if(bad_block <= MAX_LOG_BLOCKS_PER_ZONE + EXCHANGE_BLOCKS_NUM) {
                return NAND_FAIL;
            }
        } else if(spare_area[USED_OFFSET] == 0xFE) {
            logic_blockID = (spare_area[LBN0_OFFSET] + (spare_area[LBN1_OFFSET] * 256)) & 0x03FF;
            LUT_tab[logic_blockID] |= cur_block | VALID_BLOCK | USED_BLOCK;
            LUT_tab[cur_block] &= (uint16_t)(~FREE_BLOCK);
        }

        cur_block++;
    }

    /* 3rd step : locate free blocks by scanning the LUT already built partially */
    free_block = 0;
    for(cur_block = 0; cur_block < NAND_ZONE_SIZE; cur_block++) {
        if(cur_block == 81) {
        }

        if(!(LUT_tab[cur_block] & USED_BLOCK)) {
            do {
                if(LUT_tab[free_block] & FREE_BLOCK) {
                    LUT_tab [cur_block] |= free_block;
                    LUT_tab [free_block] &= ~FREE_BLOCK;
                    break;
                }

                free_block++;
            } while(free_block < NAND_ZONE_SIZE);
        }
    }

    return NAND_OK;
}

/*!
    \brief      find free exchange block, according the block number(odd number select 1001, even number select 1000)
    \param[in]  odd_even: block number is odd or even
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint16_t nand_find_free_block(uint8_t odd_even)
{
    if(BLOCK_ODD == odd_even) {
        return LUT_tab[MAX_LOG_BLOCKS_PER_ZONE] & 0x03FF;
    } else if(BLOCK_EVEN == odd_even) {
        return LUT_tab[MAX_LOG_BLOCKS_PER_ZONE + 1] & 0x03FF;
    }

    return 0xFFFF;
}

/*!
    \brief      check NAND data is right
    \param[in]  pbuf: input buffer
    \param[in]  len: buffer length
    \param[in]  value: right value in buffer
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_judge_buf_ok(uint8_t *pbuf, uint32_t len, uint8_t value)
{
    uint32_t i;

    for(i = 0; i < len; i++) {
        if(pbuf[i] != value) {
            return NAND_FAIL;
        }
    }

    return NAND_OK;
}

/*!
    \brief      check block is bad block
    \param[in]  blocknum: physical block number
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_isbad_block(uint32_t blocknum)
{
    uint8_t flag;
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE + BI_OFFSET;

    exmc_nand_read_spare(&flag, addr, 1);

    if(0xFFU != flag) {
        return NAND_FAIL;
    }

    return NAND_OK;
}

/*!
    \brief      mark used block
    \param[in]  blocknum: physical block number
    \param[out] none
    \retval     NAND_OK, NAND_FAIL
*/
static uint8_t nand_mark_used_block(uint32_t blocknum)
{
    uint8_t flag;
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE + USED_OFFSET;

    flag = NAND_USED_BLOCK_FLAG;

    if(NAND_FAIL == exmc_nand_write_spare(&flag, addr, 1)) {
        return NAND_FAIL;
    }

    return NAND_OK;
}

/*!
    \brief      mark bad block
    \param[in]  blocknum: block number
    \param[out] none
    \retval     none
*/
static void nand_mark_bad_block(uint32_t blocknum)
{
    uint8_t flag;
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE + BI_OFFSET;

    flag = NAND_BAD_BLOCK_FLAG;

    if(NAND_FAIL == exmc_nand_write_spare(&flag, addr, 1)) {
        addr.page = 1;
        exmc_nand_write_spare(&flag, addr, 1);
    }
}

/*!
    \brief      mark logic block to specific block
    \param[in]  blocknum: physical block number
    \param[in]  logblock: logic block number
    \param[out] none
    \retval     none
*/
static uint8_t nand_mark_logic_block(uint32_t blocknum, uint16_t logblock)
{
    nand_address_struct addr;

    addr.zone = cur_zone;
    addr.block = blocknum;
    addr.page = 0;
    addr.page_in_offset = NAND_PAGE_SIZE + LBN0_OFFSET;

    if(NAND_FAIL == exmc_nand_write_spare((uint8_t *)&logblock, addr, 2)) {
        return NAND_FAIL;
    }

    return NAND_OK;
}
